# Pandas: Pivot tables

In [1]:
import numpy as np
import pandas as pd

## Pivot tables

In [2]:
sales_df= pd.read_csv('sales_sample_data.csv')

In [3]:
sales_df.head()

   Order Number    Product  Cost Seller Shipped
0           101      Phone   515    Sam  Europe
1           102         TV  3000  Chris  Africa
2           103  Headphone    56    Sam  Europe
3           104         TV  3100    Ana  Europe
4           105      Watch   200  Chris  Africa

In [4]:
sales_df['Product'].unique()

array(['Phone', 'TV', 'Headphone', 'Watch', 'Laptop'], dtype=object)

In [5]:
sales_df['Seller'].unique()

array(['Sam', 'Chris', 'Ana'], dtype=object)

In [6]:
pd.pivot_table(sales_df,values='Cost',index='Seller',aggfunc=sum)

         Cost
Seller
Ana     10228
Chris   21714
Sam      7722

In [7]:
pd.pivot_table(sales_df,values='Cost',index='Seller',columns='Shipped',aggfunc='sum')

Shipped  Africa  America     Asia  Europe
Seller
Ana        58.0     60.0   1953.0  8157.0
Chris    6200.0   3500.0  11224.0   790.0
Sam         NaN    780.0   1451.0  5491.0

In [8]:
pd.pivot_table(sales_df,values='Cost',index=['Seller','Product'],aggfunc=sum).transpose()

Seller        Ana                              Chris                      \
Product Headphone Laptop Phone    TV Watch Headphone Laptop Phone     TV
Cost          288   2750   530  6210   450       154    915   525  19500

Seller              Sam
Product Watch Headphone Laptop Phone    TV Watch
Cost      620       172    950  2625  3300   675

In [9]:
pd.pivot_table(sales_df,values='Cost',index=['Product','Seller'],aggfunc=sum)

                   Cost
Product   Seller
Headphone Ana       288
          Chris     154
          Sam       172
Laptop    Ana      2750
          Chris     915
          Sam       950
Phone     Ana       530
          Chris     525
          Sam      2625
TV        Ana      6210
          Chris   19500
          Sam      3300
Watch     Ana       450
          Chris     620
          Sam       675

In [10]:
sales_df['Product'].value_counts()['Headphone']

11

In [11]:
sales_df['Seller'].value_counts()

Chris    14
Sam      13
Ana      13
Name: Seller, dtype: int64

In [12]:
sales_df['Cost'].sum()

39664